--1 /*
Вывести атрибуты: Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА.
Фильтры (AND):
•   Н_ЛЮДИ.ИМЯ < Владимир.
•   Н_ВЕДОМОСТИ.ЧЛВК_ИД > 142390.
•   Н_ВЕДОМОСТИ.ЧЛВК_ИД > 117219.
Вид соединения: LEFT JOIN
*/
SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА
FROM Н_ЛЮДИ 
LEFT JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ЛЮДИ.ИМЯ < 'Владимир' AND 
    Н_ВЕДОМОСТИ.ЧЛВК_ИД > 142390 AND 
    Н_ВЕДОМОСТИ.ЧЛВК_ИД > 117219
LIMIT 10;

--CREATE INDEX ON Н_ЛЮДИ USING BTREE(ИМЯ);
--CREATE INDEX ON Н_ВЕДОМОСТИ USING BTREE(ЧЛВК_ИД);

EXPLAIN ANALYSE SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА
                FROM Н_ЛЮДИ 
                LEFT JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
                WHERE Н_ЛЮДИ.ИМЯ < 'Владимир' AND 
                    Н_ВЕДОМОСТИ.ЧЛВК_ИД > 142390;



--2 /*
Вывести атрибуты: Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.НАЧАЛО.
Фильтры: (AND)
•   Н_ЛЮДИ.ИМЯ = Владимир.
•   Н_ОБУЧЕНИЯ.ЧЛВК_ИД < 112514.
Вид соединения: INNER JOIN.
*/
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.НАЧАЛО
FROM Н_ЛЮДИ
INNER JOIN Н_ОБУЧЕНИЯ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
INNER JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE (Н_ЛЮДИ.ИМЯ > 'Владимир' AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД < 112514)
LIMIT 10;

--CREATE INDEX ON Н_ОБУЧЕНИЯ USING BTREE (Н_ОБУЧЕНИЯ.ЧЛВК_ИД);
--CREATE INDEX ON Н_УЧЕНИКИ USING BTREE (Н_УЧЕНИКИ.ЧЛВК_ИД);

EXPLAIN ANALYSE SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.НАЧАЛО
                FROM Н_ЛЮДИ
                INNER JOIN Н_ОБУЧЕНИЯ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
                INNER JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
                WHERE (Н_ЛЮДИ.ИМЯ > 'Владимир' AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД < 112514);